// Apache开源许可证
//
// 版权所有 © 2018-2023 1.8K仔
//
// 特此免费授予获得本软件及其相关文档文件（以下简称“软件”）副本的任何人以处理本软件的权利，
// 包括但不限于使用、复制、修改、合并、发布、分发、再许可、销售软件的副本，
// 以及允许拥有软件副本的个人进行上述行为，但须遵守以下条件：
//
// 在所有副本或重要部分的软件中必须包括上述版权声明和本许可声明。
//
// 软件按“原样”提供，不提供任何形式的明示或暗示的保证，包括但不限于对适销性、适用性和非侵权的保证。
// 在任何情况下，作者或版权持有人均不对任何索赔、损害或其他责任负责，
// 无论是因合同、侵权或其他方式引起的，与软件或其使用或其他交易有关。

/**
 * 前缀：utils.axios
 * 使用方式：
 * i18n.global.t("utils.axios.Fast.NET")
 * t("utils.axios.Fast.NET")
 * $t("utils.axios.Fast.NET")
 */

export default {
    ["加载中"]: "加载中",
    ["登录已失效，请重新登录！"]: "登录已失效，请重新登录！",
    ["重新登录"]: "重新登录",
    ["重复请求，自动取消！"]: "重复请求，自动取消！",
    ["您断网了！"]: "您断网了！",
    ["文件下载失败或此文件不存在！"]: "文件下载失败或此文件不存在！",
    ["接口重定向了！"]: "接口重定向了！",
    ["参数不正确！"]: "参数不正确！",
    ["您没有权限操作（令牌、用户名、密码错误）！"]: "您没有权限操作（令牌、用户名、密码错误）！",
    ["您的访问是被禁止的！"]: "您的访问是被禁止的！",
    ["请求的资源不存在！"]: "请求的资源不存在！",
    ["请求的格式不正确！"]: "请求的格式不正确！",
    ["请求超时！"]: "请求超时！",
    ["系统已存在相同数据！"]: "系统已存在相同数据！",
    ["请求的资源被永久删除，且不会再得到的！"]: "请求的资源被永久删除，且不会再得到的！",
    ["当创建一个对象时，发生一个验证错误！"]: "当创建一个对象时，发生一个验证错误！",
    ["请求过于频繁，请稍后再试！"]: "请求过于频繁，请稍后再试！",
    ["服务器内部错误！"]: "服务器内部错误！",
    ["服务未实现！"]: "服务未实现！",
    ["网关错误！"]: "网关错误！",
    ["服务不可用，服务器暂时过载或维护！"]: "服务不可用，服务器暂时过载或维护！",
    ["服务暂时无法访问，请稍后再试！"]: "服务暂时无法访问，请稍后再试！",
    ["HTTP版本不受支持！"]: "HTTP版本不受支持！",
    ["请求错误！"]: "请求错误！",
};
