// Apache开源许可证
//
// 版权所有 © 2018-2023 1.8K仔
//
// 特此免费授予获得本软件及其相关文档文件（以下简称“软件”）副本的任何人以处理本软件的权利，
// 包括但不限于使用、复制、修改、合并、发布、分发、再许可、销售软件的副本，
// 以及允许拥有软件副本的个人进行上述行为，但须遵守以下条件：
//
// 在所有副本或重要部分的软件中必须包括上述版权声明和本许可声明。
//
// 软件按“原样”提供，不提供任何形式的明示或暗示的保证，包括但不限于对适销性、适用性和非侵权的保证。
// 在任何情况下，作者或版权持有人均不对任何索赔、损害或其他责任负责，
// 无论是因合同、侵权或其他方式引起的，与软件或其使用或其他交易有关。

/**
 * 前缀：utils.axios.config
 * 使用方式：
 * i18n.global.t("utils.axios.config.Fast.NET")
 * t("utils.axios.config.Fast.NET")
 * $t("utils.axios.config.Fast.NET")
 */

export default {
    ["加载中"]: "載入中",
    ["登录已失效，请重新登录！"]: "登入已失效，請重新登入！",
    ["重新登录"]: "重新登入",
    ["重复请求，自动取消！"]: "重複請求，自動取消！",
    ["您断网了！"]: "您斷網了！",
    ["文件下载失败或此文件不存在！"]: "文件下載失敗或此文件不存在！",
    ["接口重定向了！"]: "接口重定向了！",
    ["参数不正确！"]: "參數不正確！",
    ["您没有权限操作（令牌、用户名、密码错误）！"]: "您沒有權限操作（令牌、使用者名稱、密碼錯誤）！",
    ["您的访问是被禁止的！"]: "您的訪問是被禁止的！",
    ["请求的资源不存在！"]: "請求的資源不存在！",
    ["请求的格式不正确！"]: "請求的格式不正確！",
    ["请求超时！"]: "請求超時！",
    ["系统已存在相同数据！"]: "系統已存在相同數據！",
    ["请求的资源被永久删除，且不会再得到的！"]: "請求的資源被永久刪除，且不會再得到的！",
    ["当创建一个对象时，发生一个验证错误！"]: "當建立一個物件時，發生一個驗證錯誤！",
    ["请求过于频繁，请稍后再试！"]: "請求過於頻繁，請稍後再試！",
    ["服务器内部错误！"]: "伺服器內部錯誤！",
    ["服务未实现！"]: "服務未實現！",
    ["网关错误！"]: "網關錯誤！",
    ["服务不可用，服务器暂时过载或维护！"]: "服務不可用，伺服器暫時過載或維護！",
    ["服务暂时无法访问，请稍后再试！"]: "服務暫時無法訪問，請稍後再試！",
    ["HTTP版本不受支持！"]: "HTTP版本不受支援！",
    ["请求错误！"]: "請求錯誤！",
};
